app/Controllers/Orders.php

SELECT *
FROM `orders`
WHERE `user_id` = '5'
ORDER BY `created_at` DESC
---
    public function index()
    {
        // $check = $this->checkLogin();
        //if ($check) return $check;
        $session = session();
        $userId = $session->get('user_id');
        $ordersModel     = model('Orders_model');
        $data = [
            'title' => 'My Orders',
            'orders' => $ordersModel->where('user_id', $userId)->orderBy('created_at', 'DESC')->findAll()

SELECT *
FROM `orders`
WHERE `orders`.`id` = '9'
SELECT *
FROM `products`
WHERE `products`.`id` = '6'
UPDATE `products` SET `stock` = 2, `updated_at` = '2026-03-17 10:06:40'
WHERE `products`.`id` IN ('6')
---
    public function adminUpdateStatus($order_id)
    {
        $session = session();
        // if ($session->get('role') !== 'admin') {
        //     return redirect()->to('login');
        // }
        $orderItemsModel = model('OrderItemModel');
        $ordersModel = model('Orders_model');
        $productModel = model('Products_model');
        $status      = $this->request->getPost('status');

        if ($status === 'cancelled') {
            $order = $ordersModel->find($order_id);

            if ($order && $order['status'] !== 'cancelled') {
                $items = $orderItemsModel->getItemsByOrder($order_id);
                foreach ($items as $item) {
                    if ($item['product_id']) {
                        $product = $productModel->find($item['product_id']);
                        if ($product) {
                            $productModel->update($item['product_id'], [
                                'stock' => $product['stock'] + $item['quantity'],
                            ]);