app/Controllers/Products.php

SELECT *
FROM `products`
---
    public function index()
    {
        // $session = session();
        // if (!$session->get('isLoggedIn')) {
        //     return redirect()->to('/login')->with('error', 'Please login first.');
        // }

        $productModel = new Products_Model();
        $data = [
            'title' => 'Product Management',
            'products' => $productModel->findAll()