app/Controllers/Users.php

SELECT *
FROM `users`
---
    public function index()
    {
        $session = session();
        $checkses = $session->get('isLoggedIn');
        if (!$checkses) {
        return redirect()->to('/login')->with('error', 'Please login first.');
        }

        $usermodel = model('Users_model');
        $eqpmodel = model('Equipments_model');

        $data = array(
            'title' => 'TW32 App - Dashboard',
            'users' => $usermodel->findAll(),
            'equipments' => $eqpmodel->findAll()
        );