app/Models/OrderItemModel.php

SELECT `order_items`.*, `products`.`image`, `products`.`category`
FROM `order_items`
LEFT JOIN `products` ON `products`.`id` = `order_items`.`product_id`
WHERE `order_items`.`order_id` = '9'
---
    public function getItemsByOrder($order_id)
    {
        return $this->select('order_items.*, products.image, products.category')
                    ->join('products', 'products.id = order_items.product_id', 'left')
                    ->where('order_items.order_id', $order_id)
                    ->findAll();