app/Models/Orders_model.php

    public function getOrderWithItems($order_id)
    {
        $order = $this->select('orders.*, CONCAT(users.first_name, " ", users.last_name) AS username, users.email')
                    ->join('users', 'users.id = orders.user_id', 'left')
                    ->where('orders.id', $order_id)
                    ->first();
---
SELECT `orders`.*, CONCAT(users.first_name, " ", users.last_name) AS username, `users`.`email`
FROM `orders`
LEFT JOIN `users` ON `users`.`id` = `orders`.`user_id`
WHERE `orders`.`id` = '8'
 LIMIT 1

public function getAllWithUser()
{
    return $this->select('
            orders.id,
            orders.total,
            orders.status,
            orders.created_at,
            CONCAT(users.first_name, " ", users.last_name) AS username,
            users.email,
            MIN(order_items.product_name) AS product_name,
            MIN(order_items.variant)      AS variant,
            MIN(products.image)           AS product_image,
            SUM(order_items.quantity)     AS total_quantity
        ')
        ->join('users',       'users.id = orders.user_id',             'left')
        ->join('order_items', 'order_items.order_id = orders.id',      'left')
        ->join('products',    'products.id = order_items.product_id',  'left')
        ->groupBy('orders.id')
        ->orderBy('orders.created_at', 'DESC')
        ->findAll();
---
SELECT `orders`.`id`, `orders`.`total`, `orders`.`status`, `orders`.`created_at`, CONCAT(users.first_name, " ", users.last_name) AS username, `users`.`email`, MIN(order_items.product_name) AS product_name, MIN(order_items.variant)      AS variant, MIN(products.image)           AS product_image, SUM(order_items.quantity)     AS total_quantity
FROM `orders`
LEFT JOIN `users` ON `users`.`id` = `orders`.`user_id`
LEFT JOIN `order_items` ON `order_items`.`order_id` = `orders`.`id`
LEFT JOIN `products` ON `products`.`id` = `order_items`.`product_id`
GROUP BY `orders`.`id`
ORDER BY `orders`.`created_at` DESC

    public function updateStatus($order_id, $status)
    {
        return $this->update($order_id, ['status' => $status]);
---
UPDATE `orders` SET `status` = 'cancelled'
WHERE `orders`.`id` IN ('9')

    public function getOrdersByUserWithItems($user_id)
        {
            $orders = $this->where('user_id', $user_id)
                        ->orderBy('created_at', 'DESC')
                        ->findAll();
---
SELECT *
FROM `orders`
WHERE `user_id` = '5'
ORDER BY `created_at` DESC